// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
function rectangle (a,b){
    a=5;
    b=8;
    let result;
    result = a*b;
    return result;
}
console.log(rectangle())

// - створити функцію яка обчислює та повертає площу кола з радіусом r
function circle(r){
    r=8;
    let result;
    result = Math.PI*Math.pow(r,2);
    return result;
}
console.log(circle())

// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
function cylinder(h,r){
    h=6;
    r=9;
    let result;
    result = 2*Math.PI*h*r;
    return result;
}
console.log(cylinder())

// - створити функцію яка приймає масив та виводить кожен його елемент
arrays([41, 152, 39]);
function arrays(array) {
    for (const item of array) {
        console.log(item);
    }
}
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
function text1(){
    console.log(arguments);

}
text1(10.22)
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію sum(arr)яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад sum([1,2,10]) //->13
// - створити функцію swap(arr,index1,index2). Функція міняє місцями заняення у відаовідних індексах
// Приклад  swap([11,22,33,44],0,1) //=> [22,11,33,44]
// - Написати функцію обміну валюти exchange(sumUAH,currencyValues,exchangeCurrency)
// Приклад exchange(10000,[{currency:'USD',value:40},{currency:'EUR',value:42}],'USD') // => 250